app/Controllers/User.php

    public function store()
    {
        $validation = Services::Validation();

        $validation->setRules([
            'username' => 'required|is_unique[admin.username]',
            'password' => 'required',
            "nama" => "required",
            "telp" => "required|integer",
        ]);

        if ($validation->withRequest($this->request)->run()) {
            $this->userModel->insert([
                "kd_admin" => md5($this->request->getVar("nama") . $this->request->getVar("username") . random_int(0, 100)),
                "username" => $this->request->getVar("username"),
                "nama_admin" => $this->request->getVar("nama"),
                "no_telp" => $this->request->getVar("telp"),
                "password" => password_hash($this->request->getVar("password"), PASSWORD_BCRYPT),
            ]);
---
INSERT INTO `admin` (`kd_admin`, `username`, `nama_admin`, `no_telp`, `password`) VALUES ('18b1238046b9c3f657c386f7107a9958', 'salman', 'salman', '1414', '$2y$10$AeXRcGLm7qxj793d5HkvXOI9rAo.na5QI.TJw2ckWZZMp51ibnxu2')