app/Views/shoopingCart.php

SELECT *
FROM `menu`
WHERE `kd_menu` = '1904e4a8e59cd5d43f03dd815d213b9c'
 LIMIT 1
---
                        <tr>
                            <td class="p-2 min-w-[150px]">
                                <div class="text-left capitalize">
                                    <?= model(MenuModel::class)->where(["kd_menu" => $detail["kd_menu"]])->first()["nm_menu"] ?>